


<?php require_once("inc/top.php") ?>
    <?php require_once("inc/nav.php") ?>



<div class="container">
  <div class="row">
    <div class="aboutSchool">
      <h1>স্কুল সম্পর্কে</h1>
      <p>১ জানুয়ারি ১৯৬৩ সালে রংপুরের একমাত্র কলেজ ‘কারমাইকেল’ কে সরকারি করা হলে আসন সংখ্যা সীমাবদ্ধ হয়ে যায়। এই সময় পাশে কোন কলেজ না থাকায় ছাত্র-ছাত্রীরা পরে বিপাকে। ছাত্র-ছাত্রীদের চাহিদার তাগিদে কলেজের প্রয়োজন দেখা দিলে প্রফেসর এমান উদ্দিনের ঐকান্তিক প্রচেষ্টায় প্রফেসর ফুলে হোসেন, ডিসি ও এম কার্ণি, এডিসি আব্দুস সাত্তার, জেলা শিক্ষা অফিসার তাহেমেদুর রহমান (টি রহমান), এডভোকেট আবুল খাঁ, আমিন হোসেন, আবু সালেক, আবুল হোসেন, মঈন উদ্দিন সরকার এমপি এবং জেলার অনেক বিত্তবান ব্যক্তি অর্থ ও জমি দান করে কলেজটি প্রতিষ্ঠায় সহযোগীতা করেন। অতঃপর ২৫ জুলাই ১৯৬৩ সালে কলেজটি প্রতিষ্ঠিত হয়।</p>
      <p>প্রফেসর এমাজ উদ্দিনকে অধ্যক্ষ ও প্রফেসর ফুলে হোসেনকে উপাধ্যক্ষ করে নৈশ্য কলেজ হিসেবে কৈলাশ রঞ্জন উচ্চ বিদ্যালয়ে এবং ডে কলেজ হিসেবে রাম বাবুর জমিদার বাড়িতে (কালিধাম) কলেজটির যাত্রা শুরু। কলেজটির যাত্রা লগ্ন থেকে ১৯৯২ সাল পর্যন্ত রাজশাহী বিশ্ববিদ্যালয়ের অধিভুক্ত ছিল। প্রথম দিকে আই.এ. ক্লাশ খোলার অনুমতি দিলেও কলেজটির শিক্ষার মানের উপর ভিত্তি করে ১৯৬৫ সালে বি.এ. ক্লাশ খোলার অনুমতি দেয়। ১৯৬৭ সালে কলেজটিকে নিজস্ব ভবনে স্থানান্তরিত করা হয়। ডে কলেজ হিসেবে চালু থাকা কালিধামের জমিদার বাড়িটিতে ছাত্রাবাস খুলে দেয়া হয়। ১৯৭০ সালে রাজশাহী বিশ্ববিদ্যালয় বি.এস-সি. খোলার অনুমতি দেয়।</p>
      <p>৭১’র মহান মুক্তিযুদ্ধে রংপুরবাসীর সক্রিয় ও স্বতস্ফুর্ত অংশগ্রহণ ও ত্যাগ দেশে এবং বিদেশে ঐতিহাসিকভাবে স্বীকৃত। মুক্তিযুদ্ধে এই কলেজের ছাত্র মোসলেম উদ্দিন শহীদ হন। তাঁর স্মৃতির প্রতি শ্রদ্ধা জানাতে ছাত্রাবাসটির নাম করণ করা হয় শহী মোসলেম উদ্দিন ছাত্রাবাস। ১ নভেম্বর ১৯৮৪ সালে কলেজটি সরকারিকরণ করা হয়। এই কলেজটি সরকারি হয়ে গেলে পূর্বে তুলনায় ছাত্র/ছাত্রী প্রচুর পরিমাণে বৃদ্ধি পায়। কলেজের ছাত্র-ছাত্রীর সংখ্যা বৃদ্ধি পেতে থাকলে শ্রেণী কক্ষের সংকট দেখা দেয়। তখন নতুন নতুন ভবন তৈরি করা হয়।</p>
      <p>১৯৯৩ সালে কলেজটি জাতীয় বিশ্ববিদ্যালয়ের অধিভুক্ত হয়। পর্যায়ক্রমে ছাত্র-ছাত্রীদের আবাসন ব্যবস্থার জন্য হোস্টেল তৈরী করা হয়। ছাত্র-ছাত্রীদের সুবিধা প্রদানের জন্য রোভার স্কাউট, বাংলাদেশ ন্যাশনাল ক্যাডেট কোর (বিএনসিসি), কলেজের আর্থিক ব্যবস্থাপনায় স্বেচ্ছায় রক্ত দাতাদের সংগঠন (বাঁধন) প্রভৃতি সংগঠন ছাত্র-ছাত্রীদেরকে সুবিধা প্রদান করে আসছে। ১৯৯৭-৯৮ শিক্ষাবর্ষে জাতীয় বিশ্ববিদ্যালয় থেকে অনার্স কোর্স খোলার অনুমতি দেয়। বর্তমানে কলেজটিতে এইচএসসি, ডিগ্রি পাস কোর্স, ১৪ টি বিষয়ে অনার্স এবং ০৭ টি বিষয়ে মাস্টার্স কোর্স চালু রয়েছে।</p>
    </div>
  </div>
</div>

 <?php require_once("inc/footer.php") ?>


 <?php require_once("inc/bottom.php") ?>